///////////////////////////////////////// 用户修改参数 ///////////////////////////////////////////////////
//#define             RefInput      1800000     //  A/D参考电压,单位：微伏。
                                              //  例如：1800------表示 1.8V
#define             RefInput      2048000     //  A/D参考电压,单位：微伏。
#define             FullData      2047999     //  AD7711转换后的实际电压如果大于等于此值，屏显就会是FULL

#define             MCU_Ref       1500       //单片机的A/D参考电压
                                              //单位：毫伏
//#define             Current_Max   3000        //过流保护时使用的最高电压
                                              // 单位：毫伏
#define             Current_Max   75000       //过流电流，75mA

#define             Current_R     5.1         //  计算电流所用的电阻
                                              //  单位：欧姆
float               Proportional_Battery = 0.07;   //电池电压分压比例

////////////////////////////////////////////// END ////////////////////////////////////////////////////////